Revit 2026 API

# FamilyTypeAsValueString Method

---

Provides access to value as a string with unit in the given family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AsValueString(
	FamilyParameter familyParameter
)
```
```vb
Public Function AsValueString (
	familyParameter As FamilyParameter
) As String
```
```cpp
public:
String^ AsValueString(
	FamilyParameter^ familyParameter
)
```
```fsharp
member AsValueString :
        familyParameter : FamilyParameter -> string
```

#### Parameters

familyParameter FamilyParameter

#### Return Value

StringThe string that represents the parameter value with unit.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown if the input argument-"familyParameter"-is invalid. |

The method only applies to parameters of value types. If the parameter has no value or does not contain a numeric value, the method returns .

#### Reference

FamilyType Class

Autodesk.Revit.DB Namespace